
# -*- coding: utf-8 -*-

import png
import imglib
import ppmlib

#file = open("00.png", "rb")
file = open("01.png", "rb")
bin  = file.read()
png  = png.Png8bitPalette.load(bin)
width  = png.bitmap.width
height = png.bitmap.height

bitmap = imglib.RgbBitmap(width, height)
for y in range(height):
  for x in range(width):
    rgb = png.get_color((x, y))
    bitmap.set_pixel(x, y, rgb)

ctable = {
  (255,   0,   0): (255,   0,   0), # 80mm/h ˆÈã
  (255,   0, 255): (255,   0, 255), # 50-80mm/h
  (255, 153,   0): (255, 153,   0), # 30-50mm/h
  (255, 255,   0): (255, 255,   0), # 20-30mm/h
  (  0, 255,   0): (  0, 255,   0), # 10-20mm/h
  (  0,   0, 255): (  0,   0, 255), #  5-10mm/h
  ( 51, 102, 255): ( 51, 102, 255), #  1- 5mm/h
  (153, 204, 255): (153, 204, 255), #  0- 1mm/h

  (255, 255, 255): (255, 255, 255), # ŠCŠİ‹«ŠE
  (230, 230, 230): (255, 255, 255), # “s“¹•{Œ§‹«ŠE
  (102, 102, 102): (102, 102, 102), # ŠCŠİ‹«ŠE/ƒOƒŠƒbƒh

  (193, 193, 193): (193, 193, 193), # ŠÏ‘ª‰æ‘œ ŠC
  (136, 166, 207): (136, 166, 207), # ŠÏ‘ª‰æ‘œ ŒÎ
  (115, 141, 183): (115, 141, 183), # ŠÏ‘ª‰æ‘œ ŒÎ‹«ŠE1
  ( 94, 117, 158): ( 94, 117, 158), # ŠÏ‘ª‰æ‘œ ŒÎ‹«ŠE2
  (146, 178, 131): (146, 178, 131), # ŠÏ‘ª‰æ‘œ ‘å’n1
  (132, 167, 115): (132, 167, 115), # ŠÏ‘ª‰æ‘œ ‘å’n2

  (184, 184, 228): (184, 184, 228), # —\‘z‰æ‘œ ŠC
  (134, 164, 205): (134, 164, 205), # —\‘z‰æ‘œ ŒÎ1
  (144, 173, 211): (144, 173, 211), # —\‘z‰æ‘œ ŒÎ2
  (184, 184, 228): (184, 184, 228), # —\‘z‰æ‘œ ŒÎ3
  (117, 141, 201): (117, 141, 201), # —\‘z‰æ‘œ ŒÎ4
  (114, 141, 159): (114, 141, 159), # —\‘z‰æ‘œ ŒÎ‹«ŠE1
  ( 92, 115, 159): ( 92, 115, 159), # —\‘z‰æ‘œ ŒÎ‹«ŠE2
  (159, 187, 145): (159, 187, 145), # —\‘z‰æ‘œ ‘å’n1
  (130, 165, 113): (130, 165, 113), # —\‘z‰æ‘œ ‘å’n2
  (143, 176, 128): (143, 176, 128), # —\‘z‰æ‘œ ‘å’n3
  (136, 171, 120): (136, 171, 120), # —\‘z‰æ‘œ ‘å’n4

  ( 96,  57,  19): ( 96,  57,  19), # ŠÏ‘ª“_
}

for y in range(bitmap.height):
  for x in range(bitmap.width):
    rgb1 = bitmap.get_pixel(x, y)
    rgb2 = ctable.get(rgb1, (255, 128, 255))
    #if ctable.get(rgb1) == None:
    #  print "missing: " + repr(rgb1)
    bitmap.set_pixel(x, y, rgb2)

outfile = open("tmp.ppm", "wb")
ppm = ppmlib.PpmWriter(bitmap)
ppm.write(outfile)
outfile.close()
